# pd.Series(data = .... , index=....)

In [3]:
import pandas as pd
import numpy as np

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
labels

['a', 'b', 'c']

In [6]:
my_data

[10, 20, 30]

In [7]:
arr

array([10, 20, 30])

In [8]:
d

{'a': 10, 'b': 20, 'c': 30}

In [9]:
ser1 = pd.Series(data=my_data,index=labels)

In [10]:
ser1

a    10
b    20
c    30
dtype: int64

In [11]:
ser2 = pd.Series(my_data,labels)

In [12]:
ser2

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(arr) #bydefault its index will start from zero

0    10
1    20
2    30
dtype: int64

In [18]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [28]:
s = "hello world"
def capIt(s):
    s = ' '.join(word[0].upper() + word[1:] for word in s.split())
    return s
print(capIt(s))

Hello World

# DataFrame(data=None , index=None , column=None , dtype=None , copy=False)

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C',
    'D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
type(df['W'])

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [12]:
df['new'] = df['W'] + df['X']

In [13]:
df['new']

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
Name: new, dtype: float64

In [14]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [15]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [18]:
df.drop('new',axis = 1) #Therefore we have to specify the axis axis=0 is rows and 1 is col

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [20]:
#Though we droped new still its showing in df so we have to set inplace as True 
df.drop('new',axis=1,inplace = True)

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df.drop('E',axis=0) #Here we are not passing inplace so the main df will remain unchanged

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#Now let's see how we can get acccess to rows using two func: .loc[rowname] & .iloc[posofindex]

In [25]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [26]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [27]:
df.loc['B','Y'] #B is for row and 'Y' is for column

-0.8480769834036315

In [29]:
df.loc[['A','B'],['W','Y']] #First bracket is for row and 2nd for col

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
booldf = df>0

In [32]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [33]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [43]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [44]:
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [46]:
df[(df['W']>0) & (df['Y']>1)] #here we can't use "and" we have to use "&"

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

# Index

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df.reset_index() # If we want this to be done permanently we will pass "replace = True"

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [50]:
newind = "AW BW CW DW EW".split()
newind

['AW', 'BW', 'CW', 'DW', 'EW']

In [51]:
df['State'] = newind

In [52]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    AW
B  0.651118 -0.319318 -0.848077  0.605965    BW
C -2.018168  0.740122  0.528813 -0.589001    CW
D  0.188695 -0.758872 -0.933237  0.955057    DW
E  0.190794  1.978757  2.605967  0.683509    EW

In [53]:
df.set_index("State")

              W         X         Y         Z
State
AW     2.706850  0.628133  0.907969  0.503826
BW     0.651118 -0.319318 -0.848077  0.605965
CW    -2.018168  0.740122  0.528813 -0.589001
DW     0.188695 -0.758872 -0.933237  0.955057
EW     0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    AW
B  0.651118 -0.319318 -0.848077  0.605965    BW
C -2.018168  0.740122  0.528813 -0.589001    CW
D  0.188695 -0.758872 -0.933237  0.955057    DW
E  0.190794  1.978757  2.605967  0.683509    EW

In [58]:
# index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [62]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [63]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [67]:
df.index.names = ['Groups','Num']

In [68]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [71]:
df.loc['G1'].loc[3]['B']

0.39052784273374097

In [74]:
# Cross-section
df.xs(1,level='Num') # .xs gave the cross section of 1 num from both G1 and G2

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [75]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [76]:
df = pd.DataFrame(d)

In [78]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
df.dropna()  #go into the bracket and press shift+tab there we see that axis=0 bydefault
             # It removes the NaN respective rows and col depending on axis value

     A    B  C
0  1.0  5.0  1

In [81]:
df.dropna(axis=1) # to remove columns we set axis to zero

   C
0  1
1  2
2  3

In [83]:
df.dropna(thresh = 2) #Here thresh means the row having atleast 2 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [84]:
# To fill NaN value we use
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [85]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [86]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBy

In [87]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [88]:
df = pd.DataFrame(data)

In [89]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [90]:
mycomp = df.groupby('Company')

In [91]:
mycomp

In [92]:
mycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [93]:
mycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [94]:
mycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [96]:
mycomp.mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [98]:
df.groupby('Company').mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [99]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [100]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [101]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [102]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [104]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000